# ObjectStyleMaterialIdParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ObjectStyleMaterialIdParam Property
ParameterTypeId Class See Also
---
"Object Style Material"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ObjectStyleMaterialIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ObjectStyleMaterialIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ObjectStyleMaterialIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace